Repository: eugeneai/papers-2019
Catalog: KONT/tr/en-ru/en-ru-omegat.tmx
Source language: en_us
Languages: ru_ru

source: 134 Lermontov Street, Irkutsk, 664033, Russia
ru_ru: Ул. Лермонтова, д. 134, г. Иркутск, Россия, 664033

source: Irkutsk Scientific Center of SB RAS
ru_ru: Иркутский научный центр СО РАН

source: named, and its child namedtyped.
ru_ru: named, и ее производной namedtyped.

source: A flexible modeling tools also allow designer to extend a notation of a model (metamodel).
ru_ru: Гибкие инструменты моделирования также позволяют дизайнеру расширить семантику структур модели (метамодели).

source: A general architecture of the development tools is presented in Fig. .
ru_ru: Общая архитектура средств разработки представлена на рисунке .

source: A part of PIM could be resulted from a Computational Independent Model representing the IS and its environment on conceptual, organizational, system level, which does not define information conversion (e.g., computation).
ru_ru: Часть PIM порождается из вычислительно-независимой модели (Computational Independent Model, CIM), описывающей ИС и ее окружение на концептуальном, организационном, системном уровнях, абстрагированных, в целом, от преобразования информации и вычислений.

source: A use case can <<include>> another one or be <<extend>>-ed with another use case.
ru_ru: Один вариант использования может "включать" (<<include>>) или "уточнять" (<<extend>>) другой.

source: Acknowledgements
ru_ru: Благодарности

source: All components interact by means of network protocols and use utf-8 encoded HTML, TXT, XML and JSON formats for data representation, which are expressive enough and easily debugged.
ru_ru: Все компоненты взаимодействуют при помощи сетевых протоколов и используют форматы HTML, TXT, XML, JSON в кодировке UTF-8.

source: All relations and attributes must be expressed in a SW ontology, which should preferably be a standard one and have a publicly accessible formal definition.
ru_ru: Все отношения и атрибуты должны быть формально описаны в соответствующей онтологии, предпочтительно являющейся стандартной и общедоступной.

source: An entity can be named by means of a relation with its URI, e.g., dc:title or rdfs:label.
ru_ru: Поименование сущностей осуществляется при помощи отношений, например, dc:title и rdfs:label.

source: An entity or a relation exist if they are defined or referred with its URI.
ru_ru: Сущность и отношения существуют, если они где-то определены или где-то есть на них URI-ссылка.

source: An example of a dataflow environment synthesis encapsulating Mothur library for new generation sequencing is presented.
ru_ru: Приводится пример использования разрабатываемых инструментов для представленя модулей прикладного пакета Mothur в виде блоков визуального потокового программирования системы Rapidminer

source: Another aspect of research is integration with existing Linked Open Data sources such as .
ru_ru: Другой аспект исследования -- это интеграция с существующими приложениями открытых связанных данных, таких как .

source: Application in NGS
ru_ru: Применение в NGS

source: Architecture of MDA tools
ru_ru: Архитектура инструментов MDA

source: As stereotype does not provide a value in its association, table name for <<RDBMSRecord>> an optional tag value can be defined for this purpose, e.g., rdbms:table-name.
ru_ru: В нашем примере назначение стереотипа <<RDBMSRecord>> классу не позволяет явно задавать соответствующую таблицу, для этого можно использовать теговое значение rdbms:table-name.

source: As the entities have global identification, their mentioning in different models denote the same object, e.g., in a BPMN diagram, a record object could be created of a type defined in an UML Class Diagram.
ru_ru: Так как сущности глобально идентифицированы, их наличие в различных моделях обозначают один и тот же объект, например, в BPMN-диаграмме объект -- запись базы данных (или документ) может быть создан из типа, определенного в UML диаграмме классов.

source: By default all classes are standard <<class>>-es.
ru_ru: По умолчанию классам назначен стереотип <<class>>.

source: CASE--systems are usually developed close to standard industrial technologies; it is not popular in developing IS for small organization and startups, which is characterized with uncertainties of requirements and specification.
ru_ru: Существующие CASE-системы реализуют стандартные подходы к проектированию и поэтому не популярны в разработке WEB-приложений, в небольших организациях и стартапах, где процесс разработки характеризуется с высоким уровнем неопределенности требований и спецификаций.

source: CIM and PIM usually defined as a sets of SysML, CMMN, UML and other visual models, which saved in a standard way as XMI files.
ru_ru: CIM и PIM обычно задаются набором SysML, CMMN, UML и других визуальных моделей, которые сохраняются стандартным способом в виде XMI-файлов.

source: Class method |root::iswritef/3| is used to generate source code with a tab indent organized by |root::indent| and |root::unindent| predicates.
ru_ru: Метод класса |root::iswritef/3| используется для порождения исходного кода с необходимыми отступами, регулируемыми методами |root::indent| и |root::unindent|.

source: Conclusion
ru_ru: Заключение

source: Configurations are implemented as a prototyping hierarchies: in inheritance, a configuration are refined by replacing and adding new values.
ru_ru: Конфигурирование реализована в виде иерархии прототипирования: при наследовании, конфигурация уточняются при помощи замены существующих и добавления новых значений.

source: Dispute these notations additional data for transformation can be obtained from Semantic Web (SW), for example, ontology definitions, literal names of entities in various natural languages, current state of processes, and so on.
ru_ru: Кроме этих моделей дополнительные данные для трансформации могут быть получены из Семантического Веба (СВ), например, определения онтологии, названия сущностей в различных естественных языках, текущее состояние процессов, и так далее.

source: Domain Specific Language
ru_ru: Язык описания предметной области

source: Dynamic objects are used in construction of PSM objects, currently, each instantiation is an entity of target programming language.
ru_ru: Динамические объекты используются в формировании объектов PSM, и на данном этапе каждый экземпляр является элементом синтезируемого программного кода.

source: Each T--module in a general case is a parameterized LogTalk object.
ru_ru: Каждый Т--Модуль в общем случае является параметризованным объектом LogTalk.

source: Each block of the diagram defines an operation, which is carried on over a set of input files by one of 147 Mothur modules; the result is stored in output files.
ru_ru: Каждый блок диаграммы определяет операцию, которая преобразует набор входных файлов в набор выходных. В Mothur находится 147 модулей.

source: Each block structure, namely, the sets of input and output connections, together with parameters, reflects the interface of Mothur modules.
ru_ru: Структура каждого блока, а именно, входные и выходные соединения, а также внутренние параметры, отражают интерфейсы и структуры модулей Mothur.

source: Each item is accessed via |item/1|.
ru_ru: Каждый элемент содержимого доступен при помощи метода |item/1|.

source: Each model structure element or a relation in a model notation must have a corresponding notation in an model representation ontology.
ru_ru: Каждый элемент и отношение в нотации модели (метамодели) должны иметь соответствующие обозначения в онтологическом представлении.

source: Each object is respected as a knowledge base of encapsulated rules.
ru_ru: Каждый объект представляет собой фасад к инкапсулированным знаниям.

source: Elements of a code block can be |append|ed, |prepend|ed and |remove|ed.
ru_ru: Элементы блока кода можно добавлять в конец (|append|) и в начало (|prepend|) списка, а также удалять (|remove|).

source: Entity identification and naming in RDF have various aspects.
ru_ru: Идентификация сущностей и их поименование в RDF [[многоаспектно]].

source: Finally, SWI-Prolog has a good LogTalk compatible RDF library strongly tied to the language itself.
ru_ru: Наконец, для SWI-Prolog существует реализация LogTalk, совместимая с библиотекой RDF, которая привязана к синтаксису языка.

source: For example in Fig. CIM (3) drawn in Modelio is converted to triples with a special module ``XMI to RDF converter''.
ru_ru: Например, на рисунке CIM (3) сконструирована в редакторе Modelio и, затем, преобразована в тройки в модуле ``Конвернтер XMI в RDF''.

source: For example, all UML diagrams support stereotypes, tag values, and object constrains.
ru_ru: Например, все диаграммы UML поддерживают стереотипы (stereotypes), теговые значения (tag values) и ограничения над объектами (object constrains).

source: For example, in our project , the main PIM model is extracted from source code of the original library Mothur and converted to TTL (turtle) representation.
ru_ru: Например, в нашем проекте , основная модель PIM извлекается из исходного кода библиотеки Mothur и преобразуются в ТТЛ-формат.

source: For example, programming language objects have an identifier and, optionally, type description.
ru_ru: Например, объекты языка программирования поыменовываются идентификаторами и, часто, принадлежат к некоторому типу данных.

source: For example, the easy way of providing of an interface label name for an object age field in a class defined in a Class Diagram is an association the field with tag name interface-label-name as ``Age'' string.
ru_ru: Например, самый простой способ назначения полю класса age имени метки в интерфейсе пользователя -- это в диаграмме классов назначить этому полю теговое значение interface-label-name равное строке ``Возраст''.

source: For example, we can use DBPedia for constructing title and placeholder attributes of a web input widget, together with its label name text in user's locale and a help description.
ru_ru: Например, мы можем использовать данные DBPedia для формирования атрибутов title и placeholder элемента input, а также соответствующий текст метки (label) с учетом локальных настроек пользователя и help-текста.

source: For the subclass and subpropery relation, library realizes transitive closure, which can be used in the predicate queries.
ru_ru: Для отношений subclass и subpropery библиотека реализует транзитивное замыкание, которое использовано в предикативных запросах.

source: From other hand side, converting the complex tree-like structures used for model representation to set of triples, i.e., facts for inference machine, enables us to use Prolog--based engines for transformation definition.
ru_ru: С другой стороны, преобразование сложных древовидных структур, используемых для представления модели, в набор троек, т.е. фактов для машинного вывода, позволяет использовать Prolog в качестве основного механизма трансформации.

source: If a class is assigned standard <<interface>> stereotype then it is an interface definition.
ru_ru: Если классу назначен стандартный стереотип <<interface>>, тогда класс превращается в определение интерфейса.

source: If needed the item's definition can include provision information which can be used in result construction, when its object being queried.
ru_ru: Структура элемента блока не регламентируется, поэтому к нему можно добавлять дополнительные поля, информации которых может быть использована для хранения промежуточных данных или данных для других этапов трансформации.

source: In , ATL is used to transform Computational Independent Model (CIM) represented as BPMN diagram into set of UML diagrams, defining PIM. Paper proposes a model transformation CIM to PIM for web-applications, where CIM is represented with State and Use case UML-Diagrams logically connected with ATL rules.
ru_ru: В , ATL используется для преобразования CIM, педставленной в виде диаграммы BPMN на набор UML-диаграмм, т.е. PIM. В статье предложена модель трансформации CIM в PIM для веб-приложений, CIM представлен диаграммами UML, диаграммой состояний и диаграммой вариантов использования. Логические связи между диаграммами реализуются в ATL.

source: In is proposed an evaluation of security aspects of distributed applications using MDA description; the evaluation is implemented a logical inference over the MDA synthesized logical security models.
ru_ru: В предложен способ оценки аспектов безопасности распределенных приложений при помощи моделей MDA. Оценка реализуется при помощи логического вывода над данными, полученными в результате трансформации MDA.

source: In inheritance, methods can be reprogrammed implementing refined knowledge set.
ru_ru: При наследовании методы можно перепрограммировать наследуемый набор знаний на определенную специфику.

source: In order to meet SW requirements, each model should be identified with a global URI, and in addition, its prefix could be defined.
ru_ru: Согласно рекомендациям СВ, каждое описание модели должно быть помечено глобальным URI и, для удобства использования, некоторым синонимом-префиксом.

source: In order to support IS subsystems generation, we are to develop an expressive means for transformation from set of formalized models represented in UML, SysML, BPMN and other ones constructed with corresponding design tools.
ru_ru: Полноценная поддержка быстрого прототипирования требует разработки выразительных средств программирования трансформаций из комплекса разнородных моделей, представляющих различные аспекты ИС, например, UML, SysML, BPMN, которые задаются при помощи соответствующих визуальных инструментов.

source: In this case, class is added to set of classes describing a relation database records, all relations between such classes are interpreted as rational (one--to--one, one--to--many, many--to--many, mandatory, etc.) relations.
ru_ru: В данном случае, класс добавляется в перечень классов, определяющих структуру базы данных, все отношения между такими классами трактуются как реляционные (один-к-одному, один-к-многим, многие-к-многим, обязательные и нет) отношения.

source: Input structures of CIM and PIM models are converted into graphs with converter adapters.
ru_ru: Исходные данные моделей CIM и PIM преобразуются в графы RDF специальными адаптерами.

source: Instead, programmer can add an |item| being another code block, inserting its content in the outer block.
ru_ru: Вместо этого можно вставлять вспомогательные блоки кода как |item|-элементы основного блока, добавляя новое содержимое во вспомогательные блоки.

source: Introduction
ru_ru: Введение

source: Involving SW data is problematic.
ru_ru: Привлечение данных СВ достаточно проблематично.

source: It contains public methods for defining class elements.
ru_ru: Объект содержит публичные (public) методы для определения элементов класса.

source: It enables system designer and programmer to use globally identified resource references (URI), and ontology representation standards (RDF, RDFa, TTL, etc.), which are implemented in various programming environments as libraries.
ru_ru: Наличие этих стандартов позволяет разработчикам ИС использовать глобальные ссылки URI для идентификации конкретных объектов, а также стандарты представления онтологий RDF, RDFa, TTL. Для большинства сред программирования реализованы библиотеки поддержки технологий СВ.

source: LOD is based on RDF so our input model representation data can be used in generation the markup of the report templates and algorithms.
ru_ru: Разметка LOD основана на RDF, поэтому данные о структуре моделей можно использовать в генераторах отчетов для разметки выводимых значений.

source: Let us do some remarks.
ru_ru: Сделаем несколько пояснений.

source: Library contains predicates for loading graphs from files and internet sites, store them in various text based and binary formats for later use.
ru_ru: Библиотека содержит предикаты для загрузки графов из файлов и интернет-сайтов, хранить их в различных текстовых и двоичных форматах для последующего использования.

source: List |Result| of |render/1| specially not flatten in order to not use |append| operations.
ru_ru: Список списков |Result|, аргумент метода |render/1|, специально не разравнивается, что позволяет не использовать операцию |append|.

source: LogTalk categories is very useful way of implementing a common functionality among a set of entities.
ru_ru: Категории языка LogTalk являются удобным инструментом реализации однотипного поведения среди несвязанных одной иерархией классов.

source: LogTalk as a macro package provides two kind of objects: static and dynamic.
ru_ru: LogTalk как макропакет позволяет создавать два вида объектов -- статические и динамические.

source: LogTalk object consists of only encapsulated predicates (methods), some of them can be defined as dynamic, implementing object state.
ru_ru: Объекты LogTalk состоят только из инкапсулированных предикатов (методов), некоторые из них могут быть определены как динамические, что позволяет задавать состояния объектов.

source: MDA represents code generation as multistage process of model transformation.
ru_ru: MDA представляет процесс порождения кода подсистем ИС как многостадийный процесс преобразования исходной визуальной модели.

source: Most UML and other modeling software do not restrict names of the identifiers, together with their semantics, which is defined with transformation tools.
ru_ru: Большинство средств визуального редактирования UML не ограничивают имена идентификаторов, так же как и семантику структур, предполагая, что она определяется трансформацией.

source: Now we are working on extending the knowledge base to generate algorithms figuring out the set of acceptable connections depending input combination and module configuration.
ru_ru: Сейчас мы работаем над расширением базы знаний для генерации алгоритмов, реализующих вычисление наборов допустимых комбинаций соединений в зависимости от комбинации входных и конфигурации модуля.

source: Object Relation Mapping
ru_ru: Объектно-реляционное отображение

source: Object programming enables us to structure, manipulate the knowledge base with encapsulation, inheritance, extending and composition.
ru_ru: Объектное программирование позволяет нам структурировать, управлять базой знаний при помощи инкапсуляции, наследования, расширения и композиции.

source: Objects can be inherited (as prototypes or classes), parameterized, and composed with categories.
ru_ru: Объекты наследуются (как прототипы или классы), параметризуются и комплексируются с категориями.

source: Objects query graphs and other objects implementing a scenario of a software system synthesis within Model Driven Architecture paradigm.
ru_ru: Сценарий трансформации задается в виде объектов, делающих запросы друг к другу, и реализующих, в целом, парадигму модельно--управляемой архитектуры (Model Driven Architecture).

source: One entity can be assigned many stereotypes.
ru_ru: Каждой структуре можно назначить множество стереотипов.

source: One of auxiliary RDF--compliant data sources is DBPedia.org containing naming literals in various languages, as well as relations, of the entities represented in Wikipedia.
ru_ru: Одним из вспомогательных RDF--совместимым источником данных является сервер DBPedia.org, содержащий именованные константы в различных языках, а также полезные отношения сущностей, представленных в Википедии.

source: One of the main challenge of informational systems (IS), as well as other industrial software design, development is complexity expressed in its structure, integration with other software, fast prototyping on the stage of design.
ru_ru: Основная проблема при разработке сложных информационных систем (ИС), а также друхих систем автоматизации протизводства, -- это сложность, коотрая выражается в сложности испольуемых структур данных, интегрированием с другими системани, необходимости этапа быстрого прототипирования на этапе дизайна системы.

source: One of the paradigm of the implementation could be object--orientation, which in context of knowledge based systems will allow us to have a powerful tools enabling knowledge structuring, manipulation, and encapsulation as transformation components.
ru_ru: Внедрение объектно-ориентированного программирования позволило бы создавать трансформации, структурируя базу знаний, позволяя проводить манипуляции с наборами знаний, инкапсулировать знания в трансформационные компоненты.

source: One of the system's functioning mode will be interaction with big data storage, so after refining in the current stand--alone mode we are to develop a variant of the visual tools, which would able to query needed content from the storage and generate LOD--marked up reports.
ru_ru: Основным режимом функционирования полученной среды визуального программирования будет взаимодействие с сервером Больших данных, где хранятся результаты секвенирования собираемых проб. После реализации данной части проекта необходимо будет разработать интерфейсы и конвертеры данных к серверу, а также системы порождения отчетов исследований, которые мы предполагаем размечать согласно методике LOD.

source: Our approach allows one to use other sources (not being presented in XMI) of model information, as well as general purpose libraries in implementation of the transformation engine.
ru_ru: Наш подход позволяет использовать другие (не только в XMI) модели, а также библиотеками общего назначения в реализации модуля преобразования.

source: Overall time spent to develop the proposed transformation technique and the basic (structural) aspects of Mothur module representation is two human-months.
ru_ru: Общее время, затраченное на доработку предложенной методики трансформации на основные (структурные) аспекты Mothur и реализацию модуля трансформации -- два человека-месяца.

source: PSM and source code generation are represented with codeblock objects.
ru_ru: PSM и порождение исходного кода реализуется объектами, поддерживающими (оснащающими) интерфейс codeblock.

source: PSM is obtained from a Platform Independent Model (PIM), which describe IS more abstract without platform specifics.
ru_ru: PSM получается из платформо-независимой модели (Platform Independent Model, PIM), которая описывает ИС на более абстрактном уровне.

source: Parameterized objects should be stateless, in this case, LogTalk compiles it in statically executed code.
ru_ru: Параметризованные объекты должны быть только статическими объектами, в этом случае, LogTalk компилирует их в статически код.

source: Parametrized objects are facade interfaces to other objects (contexts), e.g., input targets and graph databases.
ru_ru: Параметризованные объекты выполняют роль интерфейсов--фасадов к другим объектам и данным графов.

source: RDF representation of the models
ru_ru: Представление данных моделей в RDF

source: Related works
ru_ru: Исследования--аналоги

source: Representation of MDA Transformation with Logical Objects
ru_ru: Представление трансформаций MDA в виде логических объектов

source: Rising the stage of code generation of IS within the development to abstract level of design allows us to produce IS prototypes as early as the specification are formalized.
ru_ru: Если проводить этап порождения исходного кода на этапах дизайна системы, тогда можно порождать прототипы системы сазу же как сформирована формализованна модели разрабатываемой ИС.

source: Rules recognize structures in the input graph elements and constructs code blocks.
ru_ru: Правила распознают композиции элементов входного графа и конструируют блоки кода.

source: SWI Prolog standard distribution contains library for RDF processing.
ru_ru: SWI-Prolog в стандартном дистрибутиве включает библиотеку для обработки RDF.

source: SWI-Prolog with macro package LogTalk meet these constraints.
ru_ru: SWI-Prolog с макропакетом LogTalk соответствует этим ограничениям.
